[
    {
        "id": "DRAFT-2026-01",
        "details": {
            "name": "Mansoor Delane",
            "position": "CB",
            "image": "/public/images/2026-draft/mansoor-delane.webp"
        },
        "meta": {
            "school": "LSU",
            "height": "6'0\"",
            "weight": "190",
            "round": "1",
            "roundPick": "11",
            "overallPick": "11",
            "grade": "A",
            "fit": "95.2"
        },
        "analysis": {
            "quote": "Delane plays corner with a competitive edge, he wants to crowd receivers and make catches uncomfortable. He stays in phase well and doesn't panic at the top of routes, which helps him contest throws without losing position. You also get real effort in run support, he'll tackle and he'll get his nose in there. The biggest question is whether he has enough pure speed to live on an island against the fastest NFL wideouts. If he's late with his feet, he can get a little handsy trying to recover. But as a total package, he looks like a starter type outside corner who brings toughness and confidence.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-02",
        "details": {
            "name": "Emmanuel McNeil-Warren",
            "position": "S",
            "image": "/public/images/2026-draft/emmanuel-mcneil-warren.jpg"
        },
        "meta": {
            "school": "TOLE",
            "height": "6'2\"",
            "weight": "202",
            "round": "2",
            "roundPick": "11",
            "overallPick": "43",
            "grade": "B",
            "fit": "82.4"
        },
        "analysis": {
            "quote": "McNeil-Warren plays fast and involved, the kind of safety who finds the ball and shows up in the action. He's willing to tackle, and he doesn't hesitate to drive downhill when he reads it. The transition challenge will be handling NFL passing concepts where route combinations and disguise punish late steps. He'll also need consistent pursuit angles, because one bad angle in the league is six points. The upside is his energy and playmaking mentality, plus the chance to contribute on special teams right away. He feels like a developmental safety who can earn a roster spot through effort and versatility.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-03",
        "details": {
            "name": "D'angelo Ponds",
            "position": "CB",
            "image": "/public/images/2026-draft/dangelo-ponds.webp"
        },
        "meta": {
            "school": "IND",
            "height": "5'9\"",
            "weight": "170",
            "round": "1",
            "roundPick": "11",
            "overallPick": "75",
            "grade": "B",
            "fit": "83.3"
        },
        "analysis": {
            "quote": "Ponds is a scrappy, sticky corner who plays like he's bigger than he is. He competes hard at the catch point and has the quickness to stay attached through route breaks. He also looks comfortable locating the ball and making plays on it, not just surviving targets. The challenge is obvious: bigger receivers will try to body him, box him out, and turn it into a strength contest. That makes technique, leverage, and timing non negotiable for him. If he stays disciplined and keeps that competitive edge, he can be a valuable starter or high end nickel type.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-04",
        "details": {
            "name": "Keylan Rutledge",
            "position": "IOL",
            "image": "/public/images/2026-draft/keylan-rutledge.webp"
        },
        "meta": {
            "school": "GT",
            "height": "6'4\"",
            "weight": "330",
            "round": "3",
            "roundPick": "23",
            "overallPick": "87",
            "grade": "C",
            "fit": "75.3"
        },
        "analysis": {
            "quote": "Rutledge is a tough, physical guard who plays like he enjoys contact. He’s steady snap to snap and brings leadership traits teams usually like in interior linemen. In the run game, he can generate movement when he keeps his pads low and keeps driving his feet. He also has enough mobility to get out on pulls and climbs without looking out of place. The pass pro focus will be handling quick counters and interior games, because that's where guards get stressed at the next level. He profiles as a starting guard candidate with a reliable baseline.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-05",
        "details": {
            "name": "Dani Dennis-Sutton",
            "position": "EDGE",
            "image": "/public/images/2026-draft/dani-dennis-sutton.webp"
        },
        "meta": {
            "school": "PSU",
            "height": "6'5\"",
            "weight": "265",
            "round": "3",
            "roundPick": "26",
            "overallPick": "90",
            "grade": "C",
            "fit": "71.6"
        },
        "analysis": {
            "quote": "Dennis-Sutton looks like an NFL edge body, strong, long, and built to hold up on early downs. He plays the run with real discipline and doesn't give ground easily. As a rusher, he has flashes that make you believe, but the week to week pass rush plan is the swing skill. If he gets too linear, tackles can ride him past the pocket, so counters matter. Coaches will love the floor because the run defense translates quickly. He projects as a player who can start because of the base game, then grow into more as a rusher.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-06",
        "details": {
            "name": "Ja'Kobi Lane",
            "position": "WR",
            "image": "/public/images/2026-draft/jakobi-lane.webp"
        },
        "meta": {
            "school": "USC",
            "height": "6'4\"",
            "weight": "200",
            "round": "4",
            "roundPick": "11",
            "overallPick": "111",
            "grade": "C",
            "fit": "76.8"
        },
        "analysis": {
            "quote": "Lane is long and physical, and he looks comfortable making catches in crowded windows. He's the kind of target quarterbacks like near the goal line because he gives them margin for error on high throws. He also has enough skill to contribute between the numbers, not just on fades. The improvement area is route polish and release work, because top corners will challenge him early and force him to win with technique. If he becomes a cleaner separator, his production ceiling rises fast. As is, he's an appealing size mismatch who can play a real role.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-07",
        "details": {
            "name": "Drew Shelton",
            "position": "OT",
            "image": "/public/images/2026-draft/drew-shelton.webp"
        },
        "meta": {
            "school": "PSU",
            "height": "6'5\"",
            "weight": "305",
            "round": "5",
            "roundPick": "11",
            "overallPick": "149",
            "grade": "C",
            "fit": "72.8"
        },
        "analysis": {
            "quote": "Shelton is an athletic tackle who moves well in space and fits modern run schemes that ask linemen to get out and run. He plays with a calm pass set and looks comfortable handling movement up front. The big concern is anchor versus NFL power, because bigger rushers will test his base. Hand placement consistency is another key, because clean strikes turn hard reps into easy reps. If he lands in a system that values angles and movement, his strengths pop. He feels like a developmental starter candidate with a realistic path to early snaps.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    },
    {
        "id": "DRAFT-2026-08",
        "details": {
            "name": "Cade Klubnik",
            "position": "QB",
            "image": "/public/images/2026-draft/cade-klubnik.webp"
        },
        "meta": {
            "school": "CLEM",
            "height": "6'2\"",
            "weight": "210",
            "round": "7",
            "roundPick": "11",
            "overallPick": "227",
            "grade": "D",
            "fit": "63.6"
        },
        "analysis": {
            "quote": "Klubnik plays with confidence and rhythm when the offense is on schedule. He's comfortable throwing on the move and can make off-platform plays when things break down. The big separator for his next level projection is decision-making under pressure, because the league punishes hesitation. He'll also be judged on ball placement, especially on intermediate throws where “close enough” becomes a turnover. When he's seeing it clearly, he can stack completions and keep tempo high. He feels like a QB whose best football shows up in a timing-based system with smart structure.",
            "cite": {
                "link": "",
                "text": ""
            }
        }
    }
]